---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
source: html/9cad2b9c-a5d2-f434-2d9a-3c9183a55ada.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase

This is the base class for analytical surface elements.

## Syntax (C#)
```csharp
public class AnalyticalSurfaceBase : AnalyticalElement
```